In [1]:
pip install psycopg2

Requirement already satisfied: psycopg2 in /Volumes/SSD SanDisk Extreme/DATA ANALYTICS/HACKIO/BOOTCAMP/16.PROYECTO_FINAL/venv/lib/python3.12/site-packages (2.9.10)

[notice] A new release of pip is available: 24.0 -> 25.1.1
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
import numpy as np
import psycopg2

In [3]:
#Creamos una variable para crear la conexi√≥n.
conn = psycopg2.connect(
    dbname = "six_majors",
    user = "my_user",
    password = "admin",
    host = "localhost",
    port = "5432"
)

In [4]:
cur = conn.cursor()

In [5]:
cur.execute("SELECT version();")
cur.fetchone()

('PostgreSQL 14.17 (Homebrew) on aarch64-apple-darwin24.2.0, compiled by Apple clang version 16.0.0 (clang-1600.0.26.6), 64-bit',)

In [7]:
df_six_majors = pd.read_excel("../data/datos_limpios/resultados_six_majors_2024.xlsx")
df_six_majors.head()

,surname,name,country,age_group,finish_time,gender,place,place_gender,marathon
0,Mengesha,Milkesa,ETH,H,02:03:17,M,1,1,Berlin Marathon
1,Kotut,Cybrian,KEN,30,02:03:22,M,2,2,Berlin Marathon
2,Alew,Haymanot,ETH,H,02:03:31,M,3,3,Berlin Marathon
3,Kiprop,Stephen,KEN,H,02:03:37,M,4,4,Berlin Marathon
4,Kiros,Hailemariyam,ETH,H,02:04:35,M,5,5,Berlin Marathon

In [8]:
#Para preparar la primera carga, creamos una tabla llamada df_marathons con los valores √∫nicos de la columna marathon:
df_marathons = df_six_majors[['marathon']].drop_duplicates()
df_marathons

                marathon
0        Berlin Marathon
54096    Boston Marathon
79598   Chicago Marathon
131462   London Marathon

In [9]:
#Ahora creamos una columna en df_marathons llamada id_marathon, que ser√° la clave primaria de la tabla:
df_marathons['id_marathon'] = np.arange(1, len(df_marathons) + 1)
df_marathons

                marathon  id_marathon
0        Berlin Marathon            1
54096    Boston Marathon            2
79598   Chicago Marathon            3
131462   London Marathon            4

In [10]:
insert_query = """

        INSERT INTO marathons (id_marathon, marathon)
        VALUES (%s, %s)    
"""

In [11]:
data_to_insert = []
for index, row in df_marathons.iterrows():
    data_to_insert.append((row['id_marathon'], row['marathon']))
#Insertamos los datos en la tabla marathons:
cur.executemany(insert_query, data_to_insert)
conn.commit()

In [13]:
#comprobamos que se han insertado los datos correctamente:
query_com = """
        SELECT * FROM marathons
"""
cur.execute(query_com)
cur.fetchall()

[(1, 'Berlin Marathon'),
 (2, 'Boston Marathon'),
 (3, 'Chicago Marathon'),
 (4, 'London Marathon')]

In [15]:
#Para la tabla country, creamos una tabla llamada df_country con los valores √∫nicos de la columna country:
df_country = df_six_majors[['country']].drop_duplicates()
df_country
#Ahora creamos una columna en df_country llamada id_country, que ser√° la clave primaria de la tabla:
df_country['id_country'] = np.arange(1, len(df_country) + 1)
df_country.head()

   country  id_country
0      ETH           1
1      KEN           2
5      JPN           3
7      ERI           4
15     ISR           5

In [16]:
insert_query = """
INSERT INTO country (id_country, country)
VALUES (%s, %s)    
"""
data_to_insert = []
for index, row in df_country.iterrows():
    data_to_insert.append((row['id_country'], row['country']))
#Insertamos los datos en la tabla country:
cur.executemany(insert_query, data_to_insert)
conn.commit()
#comprobamos que se han insertado los datos correctamente:
query_com = """
        SELECT * FROM country
"""
cur.execute(query_com)
cur.fetchall()

[(1, 'ETH'),
 (2, 'KEN'),
 (3, 'JPN'),
 (4, 'ERI'),
 (5, 'ISR'),
 (6, 'GER'),
 (7, 'DEN'),
 (8, 'CHN'),
 (9, 'AUT'),
 (10, 'NED'),
 (11, 'USA'),
 (12, 'SWE'),
 (13, 'GRE'),
 (14, 'FRA'),
 (15, 'GBR'),
 (16, 'MGL'),
 (17, 'KAZ'),
 (18, 'TPE'),
 (19, 'GUA'),
 (20, 'ISL'),
 (21, 'BEL'),
 (22, 'BUL'),
 (23, 'ITA'),
 (24, 'ARG'),
 (25, 'VIE'),
 (26, 'NOR'),
 (27, 'ESP'),
 (28, 'MEX'),
 (29, 'SUI'),
 (30, 'IRL'),
 (31, 'RUS'),
 (32, 'AUS'),
 (33, 'FIN'),
 (34, 'POL'),
 (35, 'COL'),
 (36, 'CZE'),
 (37, 'CHI'),
 (38, 'CRC'),
 (39, 'BIH'),
 (40, 'NZL'),
 (41, 'HUN'),
 (42, 'LAT'),
 (43, 'DOM'),
 (44, 'BRA'),
 (45, 'ROU'),
 (46, 'PER'),
 (47, 'RSA'),
 (48, 'MDA'),
 (49, 'POR'),
 (50, 'EST'),
 (51, 'LTU'),
 (52, 'SVK'),
 (53, 'CYP'),
 (54, 'CAN'),
 (55, 'ECU'),
 (56, 'PUR'),
 (57, 'TUR'),
 (58, 'KOR'),
 (59, 'HKG'),
 (60, 'SLO'),
 (61, 'SGP'),
 (62, 'SRB'),
 (63, 'BLR'),
 (64, 'AFG'),
 (65, 'UKR'),
 (66, 'BUR'),
 (67, 'IND'),
 (68, 'IRI'),
 (69, 'VEN'),
 (70, 'THA'),
 (71, 'LBN'),
 (72, 'QAT'),
 (73, 'LUX'),
 (74, 'OMA'),
 (75, 'PAR'),
 (76, 'ANG'),
 (77, 'MDV'),
 (78, 'EGY'),
 (79, 'ALB'),
 (80, 'HON'),
 (81, 'CUB'),
 (82, 'MLT'),
 (83, 'BOT'),
 (84, 'BAR'),
 (85, 'MAR'),
 (86, 'CPV'),
 (87, 'INA'),
 (88, 'BDI'),
 (89, 'MAS'),
 (90, 'KOS'),
 (91, 'NEP'),
 (92, 'CRO'),
 (93, 'ARM'),
 (94, 'TUN'),
 (95, 'MNE'),
 (96, 'UAE'),
 (97, 'PHI'),
 (98, 'URU'),
 (99, 'AZE'),
 (100, 'COK'),
 (101, 'LAO'),
 (102, 'AND'),
 (103, 'UZB'),
 (104, 'ESA'),
 (105, 'ZIM'),
 (106, 'KGZ'),
 (107, 'BOL'),
 (108, 'BHU'),
 (109, 'NCA'),
 (110, 'TAN'),
 (111, 'PAK'),
 (112, 'MKD'),
 (113, 'BRN'),
 (114, 'BER'),
 (115, 'PAN'),
 (116, 'BAN'),
 (117, 'DMA'),
 (118, 'BRU'),
 (119, 'IVB'),
 (120, 'FRO'),
 (121, 'SYR'),
 (122, 'JOR'),
 (123, 'MLI'),
 (124, 'CAY'),
 (125, 'UGA'),
 (126, 'SEN'),
 (127, 'ALG'),
 (128, 'KUW'),
 (129, 'PLE'),
 (130, 'CAM'),
 (131, 'WLF'),
 (132, 'MAC'),
 (133, 'NGR'),
 (134, 'RWA'),
 (135, 'GHA'),
 (136, 'ZAM'),
 (137, 'LBA'),
 (138, 'GUY'),
 (139, 'GEO'),
 (140, 'JAM'),
 (141, 'GIB'),
 (142, 'SRI'),
 (143, 'GRN'),
 (144, 'LIE'),
 (145, 'BIZ'),
 (146, 'MAW'),
 (147, 'MRI'),
 (148, 'TTO'),
 (149, 'KSA'),
 (150, 'MON'),
 (151, 'SWZ'),
 (152, 'YEM'),
 (153, 'ANT'),
 (154, 'MAD'),
 (155, 'HAI'),
 (156, 'MOZ'),
 (157, 'COM'),
 (158, 'PRK'),
 (159, 'MTQ'),
 (160, 'GUM'),
 (161, 'CHA'),
 (162, 'IRQ'),
 (163, 'TKM'),
 (164, 'CMR'),
 (165, 'COD'),
 (166, 'NaN'),
 (167, 'Sin pa√≠s'),
 (168, 'SSD'),
 (169, 'LES'),
 (170, 'BAH'),
 (171, 'LBR'),
 (172, 'MYA'),
 (173, 'ARU'),
 (174, 'CIV'),
 (175, 'GAM'),
 (176, 'CGO'),
 (177, 'LCA'),
 (178, 'SUR'),
 (179, 'SOM'),
 (180, 'AIA'),
 (181, 'ISV'),
 (182, 'SIN'),
 (183, 'VIN'),
 (184, 'TWN'),
 (185, 'KIR'),
 (186, 'SLE'),
 (187, 'LIB'),
 (188, 'TRI'),
 (189, 'SUD'),
 (190, 'SMR'),
 (191, 'NAM'),
 (192, 'GAB')]

In [17]:
df_sponsors = pd.read_excel("../data/datos_limpios/sponsors.xlsx")
df_sponsors.head()

   sponsor         marathon
0      BMW  Berlin Marathon
1   adidas  Berlin Marathon
2   Abbott  Berlin Marathon
3  Zalando  Berlin Marathon
4      TCS  London Marathon

In [18]:
#asignamos la columna id_marathon a la tabla df_sponsors para repartir cada sponsor con su respectivo marathon:
df_sponsors['id_marathon'] = df_sponsors['marathon'].map(df_marathons.set_index('marathon')['id_marathon'])
df_sponsors.head()

   sponsor         marathon  id_marathon
0      BMW  Berlin Marathon            1
1   adidas  Berlin Marathon            1
2   Abbott  Berlin Marathon            1
3  Zalando  Berlin Marathon            1
4      TCS  London Marathon            4

In [19]:
insert_query = """
INSERT INTO sponsors (id_marathon, sponsor)
VALUES (%s, %s)    
"""
data_to_insert = []
for index, row in df_sponsors.iterrows():
    data_to_insert.append((row['id_marathon'], row['sponsor']))
#Insertamos los datos en la tabla sponsors:
cur.executemany(insert_query, data_to_insert)
conn.commit()
#comprobamos que se han insertado los datos correctamente:
query_com = """
        SELECT * FROM sponsors
"""
cur.execute(query_com)
cur.fetchall()

[(1, 1, 'BMW'),
 (2, 1, 'adidas'),
 (3, 1, 'Abbott'),
 (4, 1, 'Zalando'),
 (5, 4, 'TCS'),
 (6, 4, 'New Balance'),
 (7, 4, 'Abbott'),
 (8, 4, 'Buxton'),
 (9, 4, 'Coopah'),
 (10, 4, 'enthuse'),
 (11, 4, 'Ford'),
 (12, 4, 'GetPRO'),
 (13, 4, 'HubSpot'),
 (14, 4, 'iFIT'),
 (15, 4, 'Lucozade'),
 (16, 4, 'Marathon Tour & Travel'),
 (17, 4, 'Radox'),
 (18, 4, 'Shokz'),
 (19, 4, 'Sports Tours International'),
 (20, 4, 'Tag Heuer'),
 (21, 4, 'Voltarol'),
 (22, 3, 'Bank of America'),
 (23, 3, 'Nike'),
 (24, 3, 'Abbott'),
 (25, 3, 'TCS'),
 (26, 3, 'Advocate Health Care'),
 (27, 3, 'KIA'),
 (28, 3, 'Gatorade'),
 (29, 3, 'Biofreeze'),
 (30, 2, 'Bank of America'),
 (31, 2, 'adidas'),
 (32, 2, 'Schneider Electric'),
 (33, 2, 'ESPN'),
 (34, 2, 'TCS'),
 (35, 2, 'Gatorade'),
 (36, 2, 'Samuel Adams'),
 (37, 2, 'Abbott'),
 (38, 2, 'Honda'),
 (39, 2, 'Dicks')]

In [22]:
#asignamos a la tabla df_six_majors las columnas id_marathon y id_country:
df_six_majors['id_marathon'] = df_six_majors['marathon'].map(df_marathons.set_index('marathon')['id_marathon'])
df_six_majors['id_country'] = df_six_majors['country'].map(df_country.set_index('country')['id_country'])
df_six_majors.sample(10)

,surname,name,country,age_group,finish_time,gender,place,place_gender,marathon,id_marathon,id_country
5928,Beltrami,Luca,ITA,45,03:07:42,M,5929,5323,Berlin Marathon,1,23
13795,FRANCESCHI,SABRINA,FRA,40,03:31:54,W,13799,2258,Berlin Marathon,1,14
24706,Nevers,Maggie,USA,30,03:57:20,W,24713,5535,Berlin Marathon,1,11
142339,Sara,Finch,AUS,55-59,03:32:06,W,10878,2243,London Marathon,4,32
153753,Tom,Hunt,GBR,18-39,04:04:14,M,22292,15949,London Marathon,4,15
87255,Michael,Faraj,USA,40-44,03:18:16,M,7658,6512,Chicago Marathon,3,11
126328,Rebecca,Prata,USA,25-29,05:44:38,W,46731,20510,Chicago Marathon,3,11
3874,Bui,Anh,USA,30,02:58:07,W,3875,277,Berlin Marathon,1,11
179372,Julie,Feeney,GBR,55-59,05:51:10,W,47911,18936,London Marathon,4,15
115310,Lauren,Butler,USA,25-29,04:44:15,W,35713,14046,Chicago Marathon,3,11

In [23]:
#sacamos los valores √∫nicos de la coluna age_group:
df_age_group = df_six_majors[['age_group']].drop_duplicates()
df_age_group

          age_group
0                 H
1                30
19             JU20
33               35
63               40
114              55
122              50
129              45
1978             60
3746             65
12324            70
15661            75
30362            80
38408             ‚Äì
54096         18-39
54109         40-44
54165         45-49
54512         50-54
54598         55-59
55177         60-64
57285         65-69
61889         70-74
63391         75-79
73613           80+
79598         25-29
79599         20-24
79600         30-34
79613         35-39
81077  19 and under

In [25]:
#Duplicamos el df_six_majors con un df llamado df_final:
df_final = df_six_majors.copy()
df_final.head()

,surname,name,country,age_group,finish_time,gender,place,place_gender,marathon,id_marathon,id_country
0,Mengesha,Milkesa,ETH,H,02:03:17,M,1,1,Berlin Marathon,1,1
1,Kotut,Cybrian,KEN,30,02:03:22,M,2,2,Berlin Marathon,1,2
2,Alew,Haymanot,ETH,H,02:03:31,M,3,3,Berlin Marathon,1,1
3,Kiprop,Stephen,KEN,H,02:03:37,M,4,4,Berlin Marathon,1,2
4,Kiros,Hailemariyam,ETH,H,02:04:35,M,5,5,Berlin Marathon,1,1

In [37]:
#Sacamos los valores √∫nicos de la columna age_group:
df_age_group = df_six_majors[['age_group']].drop_duplicates()
df_age_group

          age_group
0                 H
1                30
19             JU20
33               35
63               40
114              55
122              50
129              45
1978             60
3746             65
12324            70
15661            75
30362            80
38408             ‚Äì
54096         18-39
54109         40-44
54165         45-49
54512         50-54
54598         55-59
55177         60-64
57285         65-69
61889         70-74
63391         75-79
73613           80+
79598         25-29
79599         20-24
79600         30-34
79613         35-39
81077  19 and under

In [ ]:
#quiero ver las filas que tienen el valor H de la columna age_group:
df_final[df_final['age_group'] == '']

Empty DataFrame
Columns: [surname, name, country, age_group, finish_time, gender, place, place_gender, marathon, id_marathon, id_country, grupo_edad_unificado]
Index: []

In [ ]:
#para poder unificar los valores de la columna age_group:
def unificar_grupo_edad(grupo):
    if pd.isna(grupo):
        return None
    grupo = str(grupo).strip().lower()
    if grupo in ["ju20", "19 and under"]:
        return "JU20"
    elif grupo in ["20-24"]:
        return "20-24"
    elif grupo in ["25-29"]:
        return "25-29"
    elif grupo == "18-39":
        return "30-39"
    elif grupo in ["30", "30-34"]:
        return "30-34"
    elif grupo in ["35", "35-39"]:
        return "35-39"
    elif grupo in ["40", "40-44"]:
        return "40-44"
    elif grupo in ["45", "45-49"]:
        return "45-49"
    elif grupo in ["50", "50-54"]:
        return "50-54"
    elif grupo in ["55", "55-59"]:
        return "55-59"
    elif grupo in ["60", "60-64"]:
        return "60-64"
    elif grupo in ["65", "65-69"]:
        return "65-69"
    elif grupo in ["70", "70-74"]:
        return "70-74"
    elif grupo in ["75", "75-79"]:
        return "75-79"
    elif grupo in ["80", "80+"]:
        return "80+"
    elif grupo == "18-39":
        return "30-39"  
    elif grupo == "H":
        return "-"
    else:
        return "-"

# Aplicaci√≥n sobre el DataFrame
df_final["grupo_edad_unificado"] = df_final["age_group"].apply(unificar_grupo_edad)

In [ ]:
elif grupo == "18-39":
    return "30-39"

In [47]:
df_final.head(
)

,surname,name,country,finish_time,gender,place,place_gender,marathon,id_marathon,id_country,age_group,grupo_edad_unificado
0,Mengesha,Milkesa,ETH,02:03:17,M,1,1,Berlin Marathon,1,1,-,-
1,Kotut,Cybrian,KEN,02:03:22,M,2,2,Berlin Marathon,1,2,30-34,30-34
2,Alew,Haymanot,ETH,02:03:31,M,3,3,Berlin Marathon,1,1,-,-
3,Kiprop,Stephen,KEN,02:03:37,M,4,4,Berlin Marathon,1,2,-,-
4,Kiros,Hailemariyam,ETH,02:04:35,M,5,5,Berlin Marathon,1,1,-,-

In [48]:
#vemos los valores √∫nicos de la columna grupo_edad_unificado:
df_final['grupo_edad_unificado'].unique()

array(['-', '30-34', 'JU20', '35-39', '40-44', '55-59', '50-54', '45-49',
       '60-64', '65-69', '70-74', '75-79', '80+', '25-29', '20-24'],
      dtype=object)

In [49]:
#eliminamos la columna age_group y renombramos la columna grupo_edad_unificado a age_group:
df_final.drop(columns=['age_group'], inplace=True)
df_final.rename(columns={'grupo_edad_unificado': 'age_group'}, inplace=True)
df_final.head()

,surname,name,country,finish_time,gender,place,place_gender,marathon,id_marathon,id_country,age_group
0,Mengesha,Milkesa,ETH,02:03:17,M,1,1,Berlin Marathon,1,1,-
1,Kotut,Cybrian,KEN,02:03:22,M,2,2,Berlin Marathon,1,2,30-34
2,Alew,Haymanot,ETH,02:03:31,M,3,3,Berlin Marathon,1,1,-
3,Kiprop,Stephen,KEN,02:03:37,M,4,4,Berlin Marathon,1,2,-
4,Kiros,Hailemariyam,ETH,02:04:35,M,5,5,Berlin Marathon,1,1,-

In [51]:
#Creamos una tabla con los valores √∫nicos de la columna age_group:
df_age_group = df_final[['age_group']].drop_duplicates()
df_age_group
#Ahora creamos una columna en df_age_group llamada id_age_group, que ser√° la clave primaria de la tabla:
df_age_group['id_age_group'] = np.arange(1, len(df_age_group) + 1)
df_age_group

      age_group  id_age_group
0             -             1
1         30-34             2
19         JU20             3
33        35-39             4
63        40-44             5
114       55-59             6
122       50-54             7
129       45-49             8
1978      60-64             9
3746      65-69            10
12324     70-74            11
15661     75-79            12
30362       80+            13
79598     25-29            14
79599     20-24            15

In [54]:
insert_query = """
INSERT INTO age (id_age_group, age_group)
VALUES (%s, %s)    
"""
data_to_insert = []
for index, row in df_age_group.iterrows():
    data_to_insert.append((row['id_age_group'], row['age_group']))
#Insertamos los datos en la tabla age:
cur.executemany(insert_query, data_to_insert)
conn.commit()
#comprobamos que se han insertado los datos correctamente:
query_com = """
        SELECT * FROM age
"""
cur.execute(query_com)
cur.fetchall()

UniqueViolation: duplicate key value violates unique constraint "age_pkey"
DETAIL:  Key (id_age_group)=(1) already exists.

In [57]:
#borramos los datos cargados a la tabla age para volver a cargarlos corregidos:
delete_query = """
DELETE FROM age
"""
cur.execute(delete_query)
conn.commit()

In [58]:
#volvemos a cargar los datos corregidos:
insert_query = """
INSERT INTO age (id_age_group, age_group)
VALUES (%s, %s)    
"""
data_to_insert = []
for index, row in df_age_group.iterrows():
    data_to_insert.append((row['id_age_group'], row['age_group']))
#Insertamos los datos en la tabla age:
cur.executemany(insert_query, data_to_insert)
conn.commit()
#comprobamos que se han insertado los datos correctamente:
query_com = """
        SELECT * FROM age
"""
cur.execute(query_com)
cur.fetchall()

[(1, '-'),
 (2, '30-34'),
 (3, 'JU20'),
 (4, '35-39'),
 (5, '40-44'),
 (6, '55-59'),
 (7, '50-54'),
 (8, '45-49'),
 (9, '60-64'),
 (10, '65-69'),
 (11, '70-74'),
 (12, '75-79'),
 (13, '80+'),
 (14, '25-29'),
 (15, '20-24')]

In [56]:
conn.rollback()

CREATE TABLE six_majors (
    id SERIAL PRIMARY KEY,
    place INT,
    place_gender INT,
    name VARCHAR(100),
    surname VARCHAR(100),
    gender VARCHAR(1), -- M o W
    id_country INT REFERENCES country(id_country),
    id_age_group INT REFERENCES age(id_age_group),
    id_marathon INT REFERENCES marathons(id_marathon),
    finish_time TIME
);

In [59]:
#duplicamos el df_final con df_six_majors:
df_six_majors = df_final.copy()
df_six_majors.head()

,surname,name,country,finish_time,gender,place,place_gender,marathon,id_marathon,id_country,age_group
0,Mengesha,Milkesa,ETH,02:03:17,M,1,1,Berlin Marathon,1,1,-
1,Kotut,Cybrian,KEN,02:03:22,M,2,2,Berlin Marathon,1,2,30-34
2,Alew,Haymanot,ETH,02:03:31,M,3,3,Berlin Marathon,1,1,-
3,Kiprop,Stephen,KEN,02:03:37,M,4,4,Berlin Marathon,1,2,-
4,Kiros,Hailemariyam,ETH,02:04:35,M,5,5,Berlin Marathon,1,1,-

In [60]:
#a√±adimos las columnas id a df_six_majors:
df_six_majors['id_country'] = df_six_majors['country'].map(df_country.set_index('country')['id_country'])
df_six_majors['id_marathon'] = df_six_majors['marathon'].map(df_marathons.set_index('marathon')['id_marathon'])
df_six_majors['id_age_group'] = df_six_majors['age_group'].map(df_age_group.set_index('age_group')['id_age_group'])
df_six_majors.head()

,surname,name,country,finish_time,gender,place,place_gender,marathon,id_marathon,id_country,age_group,id_age_group
0,Mengesha,Milkesa,ETH,02:03:17,M,1,1,Berlin Marathon,1,1,-,1
1,Kotut,Cybrian,KEN,02:03:22,M,2,2,Berlin Marathon,1,2,30-34,2
2,Alew,Haymanot,ETH,02:03:31,M,3,3,Berlin Marathon,1,1,-,1
3,Kiprop,Stephen,KEN,02:03:37,M,4,4,Berlin Marathon,1,2,-,1
4,Kiros,Hailemariyam,ETH,02:04:35,M,5,5,Berlin Marathon,1,1,-,1

CREATE TABLE six_majors (
    id SERIAL PRIMARY KEY,
    place INT,
    place_gender INT,
    name VARCHAR(100),
    surname VARCHAR(100),
    gender VARCHAR(1), -- M o W
    id_country INT REFERENCES country(id_country),
    id_age_group INT REFERENCES age(id_age_group),
    id_marathon INT REFERENCES marathons(id_marathon),
    finish_time TIME
);

In [66]:
insert_query = """
INSERT INTO six_majors (place, place_gender, name, surname, gender, id_country, id_age_group, id_marathon, finish_time)
VALUES ( %s, %s, %s, %s, %s, %s, %s, %s, %s)    
"""
data_to_insert = []
for index, row in df_six_majors.iterrows():
    data_to_insert.append((row['place'], row['place_gender'], row['name'], row['surname'],row['gender'], row['id_country'], row['id_age_group'], row['id_marathon'], row['finish_time']))
#Insertamos los datos en la tabla six_majors:
cur.executemany(insert_query, data_to_insert)
conn.commit()
#comprobamos que se han insertado los datos correctamente:
query_com = """
        SELECT * FROM six_majors
"""
cur.execute(query_com)
cur.fetchall()

[(1, 1, 1, ' Milkesa', 'Mengesha', 'M', 1, 1, 1, datetime.time(2, 3, 17)),
 (2, 2, 2, ' Cybrian', 'Kotut', 'M', 2, 2, 1, datetime.time(2, 3, 22)),
 (3, 3, 3, ' Haymanot', 'Alew', 'M', 1, 1, 1, datetime.time(2, 3, 31)),
 (4, 4, 4, ' Stephen', 'Kiprop', 'M', 2, 1, 1, datetime.time(2, 3, 37)),
 (5, 5, 5, ' Hailemariyam', 'Kiros', 'M', 1, 1, 1, datetime.time(2, 4, 35)),
 (6, 6, 6, ' Yohei', 'Ikeda', 'M', 3, 1, 1, datetime.time(2, 5, 12)),
 (7, 7, 7, ' Tadese', 'Takele', 'M', 1, 1, 1, datetime.time(2, 5, 13)),
 (8, 8, 8, ' Oqbe Kibrom', 'Ruesom', 'M', 4, 1, 1, datetime.time(2, 5, 37)),
 (9, 9, 9, ' Enock', 'Onchari', 'M', 2, 1, 1, datetime.time(2, 5, 53)),
 (10,
  10,
  10,
  ' DERSEH KINDIE',
  'KASSIE',
  'M',
  1,
  1,
  1,
  datetime.time(2, 5, 54)),
 (11, 11, 11, ' Melaku', 'Belachew', 'M', 1, 2, 1, datetime.time(2, 6, 30)),
 (12, 12, 12, ' Luke', 'Kiprop', 'M', 2, 1, 1, datetime.time(2, 6, 39)),
 (13, 13, 13, ' Kibiwott', 'Kandie', 'M', 2, 1, 1, datetime.time(2, 6, 46)),
 (14, 14, 14, ' Bazezew', 'Asmare', 'M', 1, 1, 1, datetime.time(2, 6, 51)),
 (15, 15, 15, ' Stanley', 'Kurgat', 'M', 2, 2, 1, datetime.time(2, 7, 5)),
 (16, 16, 16, ' Haimro', 'Alame', 'M', 5, 2, 1, datetime.time(2, 7, 10)),
 (17, 17, 17, ' Sebastian', 'Hendel', 'M', 6, 1, 1, datetime.time(2, 7, 33)),
 (18,
  18,
  18,
  ' Philimon Kiptoo',
  'Kipchumba',
  'M',
  2,
  1,
  1,
  datetime.time(2, 7, 38)),
 (19, 19, 19, ' Yusuke', 'Tamura', 'M', 3, 1, 1, datetime.time(2, 7, 38)),
 (20, 20, 20, ' Dejene', 'Megersa', 'M', 1, 3, 1, datetime.time(2, 7, 49)),
 (21,
  21,
  21,
  ' Jacob Sommer',
  'Simonsen',
  'M',
  7,
  1,
  1,
  datetime.time(2, 7, 51)),
 (22, 22, 22, ' Simon', 'Kipkosgei', 'M', 2, 1, 1, datetime.time(2, 7, 56)),
 (23, 23, 23, ' Ashenafi', 'Moges', 'M', 1, 2, 1, datetime.time(2, 8, 17)),
 (24, 24, 24, ' Hendrik', 'Pfeiffer', 'M', 6, 2, 1, datetime.time(2, 8, 20)),
 (25, 25, 25, ' ERENJIA', 'JIA', 'M', 8, 2, 1, datetime.time(2, 8, 32)),
 (26, 26, 26, ' Filimon', 'Abraham', 'M', 6, 2, 1, datetime.time(2, 8, 52)),
 (27, 27, 27, ' Josphat', 'Boit', 'M', 2, 1, 1, datetime.time(2, 9, 6)),
 (28, 28, 28, ' Bethwell', 'Kipkemboi', 'M', 2, 2, 1, datetime.time(2, 9, 49)),
 (29,
  29,
  29,
  ' Haftamu',
  'Gebresilase',
  'M',
  1,
  1,
  1,
  datetime.time(2, 10, 33)),
 (30, 30, 30, ' Kento', 'Kikutani', 'M', 3, 2, 1, datetime.time(2, 11, 17)),
 (31, 31, 31, ' Hideyuki', 'Tanaka', 'M', 3, 2, 1, datetime.time(2, 11, 21)),
 (32, 32, 32, ' Asbel', 'Rutto', 'M', 2, 1, 1, datetime.time(2, 11, 46)),
 (33,
  33,
  33,
  ' Johannes',
  'Motschmann',
  'M',
  6,
  2,
  1,
  datetime.time(2, 12, 2)),
 (34, 34, 34, ' Peter', 'Herzog', 'M', 9, 4, 1, datetime.time(2, 12, 8)),
 (35, 35, 35, ' Guojian', 'Dong', 'M', 8, 4, 1, datetime.time(2, 12, 20)),
 (36, 36, 36, ' Remyo', 'Tielsema', 'M', 10, 2, 1, datetime.time(2, 12, 42)),
 (37, 37, 37, ' Tom', 'Gr√∂schel', 'M', 6, 2, 1, datetime.time(2, 12, 59)),
 (38, 38, 38, ' Erik', 'Hille', 'M', 6, 4, 1, datetime.time(2, 13, 3)),
 (39, 39, 39, ' Will', 'Nation', 'M', 11, 2, 1, datetime.time(2, 13, 11)),
 (40, 40, 40, ' JiaHao', 'Wang', 'M', 8, 1, 1, datetime.time(2, 13, 20)),
 (41, 41, 41, ' LI', 'BO', 'M', 8, 2, 1, datetime.time(2, 13, 38)),
 (42, 42, 42, ' zicheng', 'li', 'M', 8, 2, 1, datetime.time(2, 15, 8)),
 (43, 43, 43, ' Edward', 'Mulder', 'M', 11, 2, 1, datetime.time(2, 15, 16)),
 (44, 44, 44, ' David', 'Nilsson', 'M', 12, 4, 1, datetime.time(2, 16, 9)),
 (45, 45, 45, ' Yuji', 'Shibukawa', 'M', 3, 2, 1, datetime.time(2, 16, 26)),
 (46, 46, 46, ' Yuhei', 'Urano', 'M', 3, 1, 1, datetime.time(2, 16, 27)),
 (47,
  47,
  47,
  ' Panagiotis',
  'Karaiskos',
  'M',
  13,
  4,
  1,
  datetime.time(2, 16, 28)),
 (48, 48, 48, ' Thijs', 'Nijhuis', 'M', 7, 2, 1, datetime.time(2, 16, 31)),
 (49,
  49,
  49,
  ' Gabriel',
  'Lautenschlager',
  'M',
  6,
  1,
  1,
  datetime.time(2, 16, 34)),
 (50, 50, 50, ' Jackson', 'Neff', 'M', 11, 2, 1, datetime.time(2, 16, 38)),
 (51, 51, 1, ' Tigist', 'Ketema', 'W', 1, 1, 1, datetime.time(2, 16, 42)),
 (52, 52, 51, ' Brice', 'Daubord', 'M', 14, 4, 1, datetime.time(2, 16, 45)),
 (53, 53, 52, ' Norman', 'Shreeve', 'M', 15, 4, 1, datetime.time(2, 17, 13)),
 (54, 54, 53, ' LI', 'JIAN', 'M', 8, 2, 1, datetime.time(2, 17, 28)),
 (55,
  55,
  54,
  ' Olonbayar',
  'Jamsran',
  'M',
  16,
  2,
  1,
  datetime.time(2, 18, 15)),
 (56, 56, 55, ' Lianzheng', 'Wang', 'M', 8, 1, 1, datetime.time(2, 18, 29)),
 (57, 57, 56, ' Sascha', 'van Staa', 'M', 6, 2, 1, datetime.time(2, 18, 45)),
 (58, 58, 57, ' Henry', 'Hart', 'M', 15, 1, 1, datetime.time(2, 18, 45)),
 (59, 59, 2, ' Mestawot', 'Fikir', 'W', 1, 1, 1, datetime.time(2, 18, 48)),
 (60, 60, 3, ' Bosena', 'Mulatie', 'W', 1, 1, 1, datetime.time(2, 19)),
 (61, 61, 58, ' Stephen', 'Blake', 'M', 15, 4, 1, datetime.time(2, 19, 5)),
 (62,
  62,
  59,
  ' Yerzhan',
  'Janarstanov',
  'M',
  17,
  2,
  1,
  datetime.time(2, 19, 21)),
 (63, 63, 60, ' Lee', 'Davies', 'M', 15, 1, 1, datetime.time(2, 19, 25)),
 (64, 64, 61, ' Meng-Tsung', 'Chu', 'M', 18, 5, 1, datetime.time(2, 19, 36)),
 (65,
  65,
  62,
  ' Jos√© Carlos',
  'Gonz√°lez',
  'M',
  19,
  4,
  1,
  datetime.time(2, 19, 44)),
 (66, 66, 63, ' Nick', 'Bester', 'M', 15, 4, 1, datetime.time(2, 19, 45)),
 (67, 67, 64, ' Paolo', 'Tiongson', 'M', 11, 1, 1, datetime.time(2, 19, 47)),
 (68, 68, 65, ' David', 'G√§rtlein', 'M', 6, 2, 1, datetime.time(2, 19, 51)),
 (69, 69, 66, ' hugo', 'fry', 'M', 15, 1, 1, datetime.time(2, 19, 58)),
 (70, 70, 67, ' Arnar', 'Petursson', 'M', 20, 2, 1, datetime.time(2, 20, 4)),
 (71, 71, 68, ' Dylan', 'Voet', 'M', 21, 2, 1, datetime.time(2, 20, 12)),
 (72, 72, 69, ' Michel', 'Nouguier', 'M', 14, 2, 1, datetime.time(2, 20, 13)),
 (73, 73, 70, ' Miroslav', 'Spasov', 'M', 22, 1, 1, datetime.time(2, 20, 19)),
 (74, 74, 4, ' Aberu Ayana', 'Mulisa', 'W', 1, 1, 1, datetime.time(2, 20, 20)),
 (75, 75, 5, ' Ai', 'Hosoda', 'W', 3, 1, 1, datetime.time(2, 20, 31)),
 (76, 76, 71, ' Markus', 'Schweikert', 'M', 6, 2, 1, datetime.time(2, 20, 37)),
 (77, 77, 6, ' Mizuki', 'Matsuda', 'W', 3, 1, 1, datetime.time(2, 20, 42)),
 (78, 78, 72, ' Gustav', 'Kr√∏ll', 'M', 7, 1, 1, datetime.time(2, 20, 49)),
 (79, 79, 73, ' Johannes', 'Pell', 'M', 9, 2, 1, datetime.time(2, 20, 51)),
 (80, 80, 74, ' Tomos', 'Roberts', 'M', 15, 4, 1, datetime.time(2, 20, 54)),
 (81, 81, 75, ' Andrea', 'Astolfi', 'M', 23, 2, 1, datetime.time(2, 21, 7)),
 (82, 82, 76, ' Florian', 'Winker', 'M', 6, 1, 1, datetime.time(2, 21, 9)),
 (83, 83, 77, ' Lucas', 'Baez', 'M', 24, 4, 1, datetime.time(2, 21, 12)),
 (84, 84, 78, ' Yousheng', 'Guan', 'M', 8, 2, 1, datetime.time(2, 21, 13)),
 (85, 85, 79, ' Patrick', 'K√∂nig', 'M', 6, 4, 1, datetime.time(2, 21, 18)),
 (86,
  86,
  7,
  ' Calli',
  'Hauger-Thackery',
  'W',
  15,
  2,
  1,
  datetime.time(2, 21, 24)),
 (87, 87, 80, ' mohamed', 'hashi', 'M', 15, 2, 1, datetime.time(2, 21, 28)),
 (88, 88, 8, ' Yebregual', 'Melese', 'W', 1, 2, 1, datetime.time(2, 21, 39)),
 (89, 89, 81, ' Marin', 'Blondel', 'M', 14, 1, 1, datetime.time(2, 21, 40)),
 (90, 90, 82, ' David', 'Smale', 'M', 15, 2, 1, datetime.time(2, 21, 42)),
 (91, 91, 83, ' Romain', 'Wyndaele', 'M', 14, 1, 1, datetime.time(2, 21, 52)),
 (92, 92, 84, ' Florian', 'Bochert', 'M', 6, 1, 1, datetime.time(2, 22, 15)),
 (93, 93, 85, ' Julien', 'P√©ch√©', 'M', 14, 2, 1, datetime.time(2, 22, 19)),
 (94, 94, 86, ' meng', 'shuai', 'M', 8, 1, 1, datetime.time(2, 22, 36)),
 (95, 95, 87, ' San', 'Pham', 'M', 25, 2, 1, datetime.time(2, 22, 46)),
 (96, 96, 88, ' Thierry', 'ROMMEL', 'M', 14, 4, 1, datetime.time(2, 22, 49)),
 (97, 97, 89, ' Manuel', 'Schr√§der', 'M', 6, 2, 1, datetime.time(2, 23, 7)),
 (98, 98, 90, ' Jan', 'Kaumanns', 'M', 6, 2, 1, datetime.time(2, 23, 11)),
 (99, 99, 91, ' Swan', 'Blanc', 'M', 14, 1, 1, datetime.time(2, 23, 14)),
 (100,
  100,
  92,
  ' Michael',
  'Chalupski',
  'M',
  6,
  5,
  1,
  datetime.time(2, 23, 15)),
 (101, 101, 9, ' Fikrte', 'Wereta', 'W', 1, 1, 1, datetime.time(2, 23, 23)),
 (102,
  102,
  93,
  ' Sjur',
  'Eveb√∏ Haug',
  'M',
  26,
  2,
  1,
  datetime.time(2, 23, 34)),
 (103,
  103,
  94,
  ' Viktor',
  'Br√§nnmark',
  'M',
  12,
  2,
  1,
  datetime.time(2, 23, 34)),
 (104,
  104,
  10,
  ' Sisay Meseret',
  'Gola',
  'W',
  1,
  1,
  1,
  datetime.time(2, 23, 36)),
 (105, 105, 95, ' Jordi', 'Muela', 'M', 27, 4, 1, datetime.time(2, 23, 38)),
 (106, 106, 11, ' Melat', 'Kejeta', 'W', 6, 2, 1, datetime.time(2, 23, 40)),
 (107,
  107,
  96,
  ' Markus L√∏kke',
  'Granaas',
  'M',
  26,
  1,
  1,
  datetime.time(2, 23, 45)),
 (108,
  108,
  97,
  ' Christian',
  'Castro Ramirez',
  'M',
  28,
  4,
  1,
  datetime.time(2, 23, 45)),
 (109, 109, 98, ' Moritz', 'Keinath', 'M', 29, 2, 1, datetime.time(2, 23, 45)),
 (110, 110, 99, ' Rob', 'Scott', 'M', 15, 2, 1, datetime.time(2, 23, 45)),
 (111, 111, 100, ' Gregor', 'Yates', 'M', 15, 5, 1, datetime.time(2, 23, 45)),
 (112,
  112,
  101,
  ' Vincent',
  'Castermans',
  'M',
  21,
  2,
  1,
  datetime.time(2, 23, 46)),
 (113,
  113,
  102,
  ' Luis Carlos',
  'Rivero',
  'M',
  19,
  4,
  1,
  datetime.time(2, 23, 55)),
 (114, 114, 103, ' Sean', 'Renfer', 'M', 30, 4, 1, datetime.time(2, 23, 55)),
 (115,
  115,
  104,
  ' Aleksandr',
  'Rogoten',
  'M',
  31,
  6,
  1,
  datetime.time(2, 24, 5)),
 (116, 116, 105, ' Kader', 'Seyed', 'M', 15, 1, 1, datetime.time(2, 24, 8)),
 (117, 117, 106, ' Benjamin', 'Franke', 'M', 6, 4, 1, datetime.time(2, 24, 9)),
 (118, 118, 107, ' Jochen', 'Uhrig', 'M', 6, 5, 1, datetime.time(2, 24, 12)),
 (119, 119, 108, ' Kane', 'Collins', 'M', 30, 1, 1, datetime.time(2, 24, 12)),
 (120,
  120,
  109,
  ' Antonio',
  'Roca D√≠az',
  'M',
  7,
  1,
  1,
  datetime.time(2, 24, 13)),
 (121, 121, 110, ' Wout', 'Croonen', 'M', 21, 1, 1, datetime.time(2, 24, 14)),
 (122,
  122,
  111,
  ' Gianluca',
  'Ferrato',
  'M',
  23,
  2,
  1,
  datetime.time(2, 24, 16)),
 (123, 123, 112, ' Isaiah', 'Kosgei', 'M', 2, 7, 1, datetime.time(2, 24, 16)),
 (124,
  124,
  113,
  ' Matthias',
  'Ewender',
  'M',
  6,
  5,
  1,
  datetime.time(2, 24, 17)),
 (125, 125, 114, ' Magnus', 'Warvik', 'M', 26, 2, 1, datetime.time(2, 24, 19)),
 (126, 126, 115, ' Chris', 'Zuerner', 'M', 11, 4, 1, datetime.time(2, 24, 19)),
 (127, 127, 116, ' Luke', 'Trimble', 'M', 11, 4, 1, datetime.time(2, 24, 21)),
 (128,
  128,
  117,
  ' Mathieu',
  'van Overeem',
  'M',
  21,
  4,
  1,
  datetime.time(2, 24, 21)),
 (129,
  129,
  118,
  ' Anthony',
  'Tomsich',
  'M',
  6,
  4,
  1,
  datetime.time(2, 24, 35)),
 (130, 130, 12, ' Lisa', 'Weightman', 'W', 32, 8, 1, datetime.time(2, 24, 40)),
 (131,
  131,
  119,
  ' Mamiyo',
  'Hirsuato',
  'M',
  1,
  4,
  1,
  datetime.time(2, 24, 46)),
 (132, 132, 120, ' Adrian', 'Beer', 'M', 32, 2, 1, datetime.time(2, 24, 50)),
 (133, 133, 121, ' XIAOYANG', 'SUN', 'M', 8, 2, 1, datetime.time(2, 24, 50)),
 (134, 134, 122, ' Ben', 'Jones', 'M', 15, 2, 1, datetime.time(2, 24, 54)),
 (135,
  135,
  123,
  ' Brian Birch',
  'Strandby',
  'M',
  7,
  8,
  1,
  datetime.time(2, 25, 12)),
 (136,
  136,
  124,
  ' Michael',
  'Potthoff',
  'M',
  6,
  1,
  1,
  datetime.time(2, 25, 14)),
 (137, 138, 13, ' Bekelech', 'Gudeta', 'W', 1, 1, 1, datetime.time(2, 25, 19)),
 (138,
  137,
  125,
  ' Maxime',
  'PERRINEAU',
  'M',
  14,
  2,
  1,
  datetime.time(2, 25, 19)),
 (139, 139, 126, ' callum', 'drake', 'M', 32, 2, 1, datetime.time(2, 25, 20)),
 (140, 140, 127, ' Tyler', 'Smith', 'M', 11, 1, 1, datetime.time(2, 25, 22)),
 (141, 141, 128, ' Henrik', 'Zeffer', 'M', 12, 5, 1, datetime.time(2, 25, 23)),
 (142,
  142,
  129,
  ' Aske Colding',
  'Ekman',
  'M',
  7,
  1,
  1,
  datetime.time(2, 25, 24)),
 (143,
  143,
  130,
  ' Maciek',
  'Miereczko',
  'M',
  6,
  8,
  1,
  datetime.time(2, 25, 25)),
 (144,
  144,
  131,
  ' Christian',
  'Hiller',
  'M',
  6,
  4,
  1,
  datetime.time(2, 25, 31)),
 (145, 145, 14, ' Alisa', 'Vainio', 'W', 33, 1, 1, datetime.time(2, 25, 36)),
 (146, 146, 132, ' Adrien', 'Royer', 'M', 14, 1, 1, datetime.time(2, 25, 36)),
 (147,
  147,
  133,
  ' √òyvind Moen',
  'Fjeld',
  'M',
  26,
  4,
  1,
  datetime.time(2, 25, 44)),
 (148,
  148,
  134,
  ' Jef',
  'Van Den Bergh',
  'M',
  21,
  2,
  1,
  datetime.time(2, 25, 46)),
 (149,
  149,
  15,
  ' Philippa',
  'Bowden',
  'W',
  15,
  1,
  1,
  datetime.time(2, 25, 47)),
 (150,
  150,
  135,
  ' Pawel',
  'Machowski',
  'M',
  34,
  2,
  1,
  datetime.time(2, 25, 48)),
 (151, 151, 136, ' Claas', 'Jantz', 'M', 6, 4, 1, datetime.time(2, 25, 49)),
 (152, 152, 137, ' Daniel', 'Nash', 'M', 15, 2, 1, datetime.time(2, 25, 50)),
 (153,
  153,
  138,
  ' JAIRO ALONSO',
  'SALAZAR JIMENEZ',
  'M',
  35,
  4,
  1,
  datetime.time(2, 25, 53)),
 (154, 154, 139, ' Jacob', 'Anderson', 'M', 11, 1, 1, datetime.time(2, 26, 8)),
 (155, 155, 140, ' Gilles', 'Honor√©', 'M', 21, 2, 1, datetime.time(2, 26, 13)),
 (156, 156, 141, ' Marco', 'Fasel', 'M', 29, 2, 1, datetime.time(2, 26, 14)),
 (157,
  157,
  142,
  ' Fran√ßois',
  'Chalus',
  'M',
  29,
  1,
  1,
  datetime.time(2, 26, 17)),
 (158, 158, 143, ' Martin', 'Brekke', 'M', 26, 2, 1, datetime.time(2, 26, 20)),
 (159,
  159,
  144,
  ' Milan',
  'Janousek',
  'M',
  36,
  2,
  1,
  datetime.time(2, 26, 20)),
 (160,
  160,
  145,
  ' Rodrigo',
  'MACHADO HAMILTON',
  'M',
  37,
  2,
  1,
  datetime.time(2, 26, 29)),
 (161,
  161,
  146,
  ' Korbinian',
  'V√∂lkl',
  'M',
  6,
  2,
  1,
  datetime.time(2, 26, 29)),
 (162, 162, 147, ' Myron', 'Spoor', 'M', 10, 2, 1, datetime.time(2, 26, 30)),
 (163, 163, 148, ' Tim', 'Van hamme', 'M', 21, 2, 1, datetime.time(2, 26, 36)),
 (164, 164, 149, ' Luis', 'Quesada', 'M', 38, 2, 1, datetime.time(2, 26, 42)),
 (165, 165, 150, ' Simon', 'K√ºhn', 'M', 6, 4, 1, datetime.time(2, 26, 43)),
 (166, 166, 151, ' David', 'Prosser', 'M', 15, 4, 1, datetime.time(2, 26, 47)),
 (167,
  167,
  152,
  ' Peter',
  'Mackrell',
  'M',
  15,
  5,
  1,
  datetime.time(2, 26, 50)),
 (168, 168, 16, ' Pauline', 'Esikon', 'W', 2, 2, 1, datetime.time(2, 26, 53)),
 (169,
  169,
  153,
  ' Connor',
  'Montgomery',
  'M',
  11,
  1,
  1,
  datetime.time(2, 26, 53)),
 (170, 170, 154, ' Thor', 'Skifte', 'M', 7, 1, 1, datetime.time(2, 26, 54)),
 (171,
  171,
  155,
  ' Micka√´l',
  'Jaunet',
  'M',
  14,
  5,
  1,
  datetime.time(2, 26, 54)),
 (172, 172, 156, ' Oscar', 'Haven', 'M', 15, 2, 1, datetime.time(2, 26, 57)),
 (173,
  173,
  157,
  ' Borja',
  'Barrague',
  'M',
  27,
  5,
  1,
  datetime.time(2, 26, 57)),
 (174,
  174,
  158,
  ' ALEXANDROS',
  'SOUKOULIS',
  'M',
  13,
  1,
  1,
  datetime.time(2, 27)),
 (175, 175, 159, ' Espen', 'S√¶ther', 'M', 26, 1, 1, datetime.time(2, 27, 3)),
 (176,
  176,
  160,
  ' Fabian',
  'Kuklinski',
  'M',
  6,
  2,
  1,
  datetime.time(2, 27, 5)),
 (177, 177, 161, ' Lothar', 'Wyrwoll', 'M', 6, 2, 1, datetime.time(2, 27, 5)),
 (178, 178, 162, ' Seppe', 'Odeyn', 'M', 21, 4, 1, datetime.time(2, 27, 10)),
 (179, 179, 163, ' Emir', 'Hastor', 'M', 39, 2, 1, datetime.time(2, 27, 14)),
 (180,
  180,
  164,
  ' Anton',
  'Chernysh',
  'M',
  31,
  4,
  1,
  datetime.time(2, 27, 17)),
 (181, 181, 165, ' Matt', 'Kusak', 'M', 11, 1, 1, datetime.time(2, 27, 18)),
 (182, 182, 166, ' Mathew', 'Speed', 'M', 15, 2, 1, datetime.time(2, 27, 21)),
 (183, 183, 167, ' Thomas', 'Gill', 'M', 11, 1, 1, datetime.time(2, 27, 21)),
 (184,
  184,
  168,
  ' Alexander',
  'Wallace',
  'M',
  15,
  8,
  1,
  datetime.time(2, 27, 21)),
 (185,
  185,
  169,
  ' Sebastian',
  'Travella',
  'M',
  32,
  4,
  1,
  datetime.time(2, 27, 24)),
 (186,
  186,
  170,
  ' Sanchez Mosquera',
  'Jonathan',
  'M',
  27,
  4,
  1,
  datetime.time(2, 27, 24)),
 (187, 187, 171, ' Marc', 'Tortell', 'M', 6, 1, 1, datetime.time(2, 27, 24)),
 (188, 188, 172, ' Marcin', 'Getek', 'M', 34, 5, 1, datetime.time(2, 27, 25)),
 (189, 189, 173, ' HAITONG', 'WU', 'M', 8, 4, 1, datetime.time(2, 27, 26)),
 (190,
  190,
  174,
  ' Alexander',
  'Geddes',
  'M',
  40,
  2,
  1,
  datetime.time(2, 27, 26)),
 (191, 191, 175, ' G√°bor', 'J√≥zsa', 'M', 41, 5, 1, datetime.time(2, 27, 29)),
 (192,
  192,
  176,
  ' Jarle',
  'Wermskog',
  'M',
  26,
  5,
  1,
  datetime.time(2, 27, 29)),
 (193, 193, 17, ' N√≥ra', 'Szab√≥', 'W', 41, 4, 1, datetime.time(2, 27, 31)),
 (194, 194, 18, ' Melina', 'Wolf', 'W', 6, 2, 1, datetime.time(2, 27, 34)),
 (195, 195, 177, ' Simon', 'St√ºtzel', 'M', 6, 4, 1, datetime.time(2, 27, 35)),
 (196,
  196,
  178,
  ' Julian',
  'Steenman',
  'M',
  10,
  1,
  1,
  datetime.time(2, 27, 36)),
 (197,
  197,
  179,
  ' Alfreds',
  'Apinis',
  'M',
  42,
  1,
  1,
  datetime.time(2, 27, 40)),
 (198,
  198,
  180,
  ' Leopoldo',
  'Burguete',
  'M',
  14,
  1,
  1,
  datetime.time(2, 27, 43)),
 (199, 199, 181, ' Gaute', 'Byberg', 'M', 26, 1, 1, datetime.time(2, 27, 46)),
 (200,
  200,
  182,
  ' Simon',
  'Karlsson',
  'M',
  12,
  2,
  1,
  datetime.time(2, 27, 48)),
 (201,
  201,
  183,
  ' Aidan',
  'Banfield',
  'M',
  15,
  1,
  1,
  datetime.time(2, 27, 49)),
 (202,
  202,
  184,
  ' Amauri David',
  'Rodriguez Grullon',
  'M',
  43,
  1,
  1,
  datetime.time(2, 27, 52)),
 (203, 203, 185, ' Nico', 'Fuchs', 'M', 6, 1, 1, datetime.time(2, 27, 58)),
 (204, 204, 186, ' Sean', "O'Reilly", 'M', 11, 2, 1, datetime.time(2, 28)),
 (205, 205, 187, ' Daan', 'Robben', 'M', 10, 4, 1, datetime.time(2, 28, 3)),
 (206,
  206,
  188,
  ' Mateus',
  'Sacchett',
  'M',
  44,
  2,
  1,
  datetime.time(2, 28, 5)),
 (207, 207, 189, ' Evan', 'Cooper', 'M', 11, 2, 1, datetime.time(2, 28, 5)),
 (208, 208, 190, ' Jonas', 'M√ºller', 'M', 6, 2, 1, datetime.time(2, 28, 7)),
 (209, 209, 191, ' Dean', 'Sauthoff', 'M', 6, 2, 1, datetime.time(2, 28, 9)),
 (210, 210, 192, ' Kim', 'Bowling', 'M', 15, 2, 1, datetime.time(2, 28, 13)),
 (211, 211, 193, ' Jay', 'Thomson', 'M', 11, 8, 1, datetime.time(2, 28, 13)),
 (212, 212, 194, ' Moritz', 'Wei√ü', 'M', 6, 2, 1, datetime.time(2, 28, 14)),
 (213, 213, 195, ' Jake', 'Dearden', 'M', 15, 1, 1, datetime.time(2, 28, 15)),
 (214,
  214,
  196,
  ' Kasper Laumann',
  'Hartlev',
  'M',
  7,
  2,
  1,
  datetime.time(2, 28, 16)),
 (215, 215, 197, ' Robert', 'Wilson', 'M', 11, 1, 1, datetime.time(2, 28, 18)),
 (216, 216, 198, ' Brian', 'Chin', 'M', 11, 2, 1, datetime.time(2, 28, 20)),
 (217, 217, 199, ' SHIRONG', 'LI', 'M', 8, 1, 1, datetime.time(2, 28, 20)),
 (218,
  218,
  200,
  ' Marius',
  'Trompetter',
  'M',
  6,
  2,
  1,
  datetime.time(2, 28, 21)),
 (219,
  219,
  201,
  ' Logan',
  'Broadbent',
  'M',
  11,
  4,
  1,
  datetime.time(2, 28, 22)),
 (220,
  220,
  202,
  ' Dominic',
  'Baxter',
  'M',
  15,
  4,
  1,
  datetime.time(2, 28, 22)),
 (221, 221, 203, ' ATI', 'NIANZHE', 'M', 8, 1, 1, datetime.time(2, 28, 24)),
 (222,
  222,
  204,
  ' Alexandru',
  'Corneschi',
  'M',
  45,
  2,
  1,
  datetime.time(2, 28, 27)),
 (223, 223, 205, ' Fred', 'Davies', 'M', 15, 1, 1, datetime.time(2, 28, 27)),
 (224,
  224,
  206,
  ' Danny',
  'Soglanich',
  'M',
  32,
  4,
  1,
  datetime.time(2, 28, 27)),
 (225, 225, 207, ' Troy', 'Conley', 'M', 11, 2, 1, datetime.time(2, 28, 28)),
 (226, 226, 208, ' Charlie', 'Lyons', 'M', 15, 1, 1, datetime.time(2, 28, 32)),
 (227,
  227,
  209,
  ' Jonathan',
  'Neville',
  'M',
  15,
  2,
  1,
  datetime.time(2, 28, 32)),
 (228, 228, 19, ' Vanessa', 'Wilson', 'W', 32, 5, 1, datetime.time(2, 28, 34)),
 (229, 229, 210, ' Jamie', 'Signy', 'M', 15, 4, 1, datetime.time(2, 28, 35)),
 (230,
  230,
  211,
  ' Martin',
  'Vermeer',
  'M',
  10,
  5,
  1,
  datetime.time(2, 28, 37)),
 (231,
  231,
  212,
  ' Niels',
  'Esmeijer',
  'M',
  10,
  5,
  1,
  datetime.time(2, 28, 38)),
 (232, 232, 213, ' Hannes', 'Piffko', 'M', 6, 5, 1, datetime.time(2, 28, 39)),
 (233,
  233,
  214,
  ' Gerard',
  'Garrote Say√≥',
  'M',
  27,
  4,
  1,
  datetime.time(2, 28, 40)),
 (234, 234, 215, ' John', 'Kinsella', 'M', 30, 5, 1, datetime.time(2, 28, 40)),
 (235,
  235,
  216,
  ' Tanguy',
  'LE FLOCH',
  'M',
  14,
  2,
  1,
  datetime.time(2, 28, 41)),
 (236,
  236,
  217,
  ' Bj√∏rn Andr√©',
  'Aaslund',
  'M',
  26,
  1,
  1,
  datetime.time(2, 28, 41)),
 (237,
  237,
  218,
  ' NICOLAS',
  'MEUNIER',
  'M',
  14,
  5,
  1,

In [65]:
#hacemos rollback para deshacer la transacci√≥n:
conn.rollback()